TexhFexLabs/HydroNodeStation/stm32_node/LoRaWAN/App/lora_app.c
/* USER CODE END EF */

/*
 * -----------------------------------------------------------------------------
 * --- PUBLIC FUNCTIONS DEFINITION ---------------------------------------------
 */

void LoRaWAN_Init(void)
{
  /* USER CODE BEGIN LoRaWAN_Init_LV */
  lr1mac_version_t lorawan_version;
  lr1mac_version_t rp_version;

  /* USER CODE END LoRaWAN_Init_LV */

  /* USER CODE BEGIN LoRaWAN_Init_1 */

  APP_LOG(TS_OFF, VLEVEL_M, "LoRaWAN End Node LBM\r\n");
  /* Get LoRaWAN APP version*/
  APP_LOG(TS_OFF, VLEVEL_M, "APPLICATION_VERSION: V%X.%X.%X\r\n",
          (uint8_t)(APP_VERSION_MAIN),
          (uint8_t)(APP_VERSION_SUB1),
          (uint8_t)(APP_VERSION_SUB2));

  /* Get MW LoRaWAN info */
  APP_LOG(TS_OFF, VLEVEL_M, "MW_LORAWAN_VERSION:  V%X.%X.%X\r\n",
          (uint8_t)(LORAWAN_VERSION_MAIN),
          (uint8_t)(LORAWAN_VERSION_SUB1),
          (uint8_t)(LORAWAN_VERSION_SUB2));

  /* Get MW SubGhz_Phy info */
  APP_LOG(TS_OFF, VLEVEL_M, "MW_RADIO_VERSION:    V%X.%X.%X\r\n",
          (uint8_t)(SUBGHZ_PHY_VERSION_MAIN),
          (uint8_t)(SUBGHZ_PHY_VERSION_SUB1),
          (uint8_t)(SUBGHZ_PHY_VERSION_SUB2));

  /* Get LoRaWAN Link Layer info */
  memset(&lorawan_version, 0, sizeof(lr1mac_version_t));
  lorawan_version = lorawan_api_get_spec_version(STACK_ID);

  APP_LOG(TS_OFF, VLEVEL_M, "L2_SPEC_VERSION:     V%X.%X.%X\r\n",
          (uint8_t)(lorawan_version.major),
          (uint8_t)(lorawan_version.minor),
          (uint8_t)(lorawan_version.patch));

  /* Get LoRaWAN Regional Parameters info */
  memset(&rp_version, 0, sizeof(lr1mac_version_t));
  rp_version = lorawan_api_get_regional_parameters_version(STACK_ID);
  APP_LOG(TS_OFF, VLEVEL_M, "RP_SPEC_VERSION:     V%X-%X.%X.%X\r\n",
          (uint8_t)(rp_version.revision),
          (uint8_t)(rp_version.major),
          (uint8_t)(rp_version.minor),
          (uint8_t)(rp_version.patch));

  // UTIL_TIMER_Create(&TxLedTimer, LED_PERIOD_TIME, UTIL_TIMER_ONESHOT, OnTxTimerLedEvent, NULL);
  // UTIL_TIMER_Create(&RxLedTimer, LED_PERIOD_TIME, UTIL_TIMER_ONESHOT, OnRxTimerLedEvent, NULL);
  // UTIL_TIMER_Create(&JoinLedTimer, LED_PERIOD_TIME, UTIL_TIMER_PERIODIC, OnJoinTimerLedEvent, NULL);
  UTIL_TIMER_Create(&Scd41Timer, SCD41_PRE_MEASUREMENT_TIME_MS, UTIL_TIMER_ONESHOT, OnScd41TimerEvent, NULL);
  UTIL_TIMER_Create(&Sps30Timer, SPS30_PRE_MEASUREMENT_TIME_MS, UTIL_TIMER_ONESHOT, OnSps30TimerEvent, NULL);
  UTIL_TIMER_Create(&Sps30CleanupTimer, SPS30_CLEANING_DURATION_MS, UTIL_TIMER_ONESHOT, OnSps30CleanupTimerEvent, NULL);

  /* USER CODE END LoRaWAN_Init_1 */

  if (FLASH_IF_Init(FLASH_RAM_buffer) != FLASH_IF_OK)
  {
    Error_Handler();
  }

#if defined (LOW_POWER_DISABLE) && (LOW_POWER_DISABLE == 0)
  UTIL_TIMER_Create(&SleepTimer, LED_PERIOD_TIME, UTIL_TIMER_ONESHOT, OnSleepTimerEvent, NULL);
#endif /* (LOW_POWER_DISABLE) && (LOW_POWER_DISABLE == 0) */
  /* Init the Lora Stack*/
  /* Init the modem and use EventCallback as event callback, please note that the callback will be */
  /* called immediately after the first call to smtc_modem_run_engine because of the reset detection */
  smtc_modem_init(&Callbacks);

  /* Certification mode is disabled by default. It can be enabled setting LORAWAN_CERTIFICATION_MODE to true */
  smtc_modem_set_certification_mode(STACK_ID, CertMode);

  /* BSP crystal accurrancy could be set to a different value. By default it is 10. */
  smtc_modem_set_crystal_error_ppm(BSP_CRYSTAL_ERROR);

  /* USER CODE BEGIN LoRaWAN_Init_Last */
  // UTIL_TIMER_Start(&JoinLedTimer);

  EnvSensors_Init();

  HAL_Delay(2000);
  
  /* Initial fan clean check if battery is good */
  sensor_t init_sensor_data;
  (void)EnvSensors_Read(&init_sensor_data, SENSOR_FLAG_ONLY_BATTERY);
  uint16_t init_battery_mv = init_sensor_data.battery_voltage;
  APP_LOG(TS_OFF, VLEVEL_M, "Init Bat (VBat=%u mV)\r\n", (unsigned)init_battery_mv);
  if (init_battery_mv > 4050)
  {
    APP_LOG(TS_OFF, VLEVEL_M, "Initial SPS30 fan cleaning (VBat=%u mV)\r\n", (unsigned)init_battery_mv);
    if ((SPS30_AcquireBus() == SPS30_STATUS_OK) && (SPS30_WakeUp() == SPS30_STATUS_OK))
    {
       (void)SPS30_StartMeasurement();
       HAL_Delay(50);
       if (SPS30_StartFanCleaning() == SPS30_STATUS_OK)
       {
         UTIL_TIMER_Start(&Sps30CleanupTimer);
       }
       else
       {
         APP_LOG(TS_OFF, VLEVEL_M, "Initial SPS30 fan cleaning start failed\r\n");
         (void)SPS30_StopMeasurement();
         (void)SPS30_Sleep();
       }
        last_sps30_clean_timestamp = SysTimeGet().Seconds;
    }
    else
    {
      APP_LOG(TS_OFF, VLEVEL_M, "Initial SPS30 bus acquire/wakeup failed\r\n");
    }
    (void)SPS30_ReleaseBus();
  }

  APP_LOG(TS_OFF, VLEVEL_M, "Sensors initialized\r\n");
  /* USER CODE END LoRaWAN_Init_Last */
}

void LoRaWAN_Process(void)
{
  uint32_t sleep_time_ms = 0;
  /* Check button */
  if (user_button_is_press == true)
  {
    user_button_is_press = false;

    smtc_modem_status_mask_t status_mask = 0;
    smtc_modem_get_status(STACK_ID, &status_mask);
    /* Check if the device has already joined a network */
    if ((status_mask & SMTC_MODEM_STATUS_JOINED) == SMTC_MODEM_STATUS_JOINED)
    {
      /* Send packet */
      SendTxData(LORAWAN_USER_APP_PORT);
    }
  }

  /* Modem process launch */
  sleep_time_ms = smtc_modem_run_engine();

  /* Atomically check sleep conditions (button was not pressed and no modem flags pending) */

  if ((user_button_is_press == false) && (smtc_modem_is_irq_flag_pending() == false))
  {
    if (sleep_time_ms > 0)
    {
#if defined (LOW_POWER_DISABLE) && (LOW_POWER_DISABLE == 0)
      UTIL_TIMER_SetPeriod(&SleepTimer, sleep_time_ms);
      UTIL_TIMER_Start(&SleepTimer);
      UTIL_LPM_EnterLowPower();
#endif
    }
  }

}

static void SystemReset(void)
{
  /* USER CODE BEGIN SystemReset_1 */

  /* USER CODE END SystemReset_1 */
  __disable_irq();
  HAL_NVIC_SystemReset();   /* Restart system */
  /* USER CODE BEGIN SystemReset_Last */

