TexhFexLabs/HydroNodeStation/stm32_node/LoRaWAN/App/lora_app.c
      case SMTC_MODEM_EVENT_JOINFAIL:
        APP_LOG(TS_OFF, VLEVEL_M,  "Event received: JOINFAIL\r\n");
        smtc_modem_get_status(STACK_ID, &status_mask);
        /* USER CODE BEGIN EventCallback_4 */
        /* Check if the device has already joined a network */
        // if ((!JoinLedTimer.IsRunning) && (status_mask & SMTC_MODEM_STATUS_JOINED) != SMTC_MODEM_STATUS_JOINED)
        // {
        //   UTIL_TIMER_Start(&JoinLedTimer);
        // }
        /* USER CODE END EventCallback_4 */
        break;

      case SMTC_MODEM_EVENT_ALCSYNC_TIME:
        APP_LOG(TS_OFF, VLEVEL_M,  "Event received: ALCSync service TIME\r\n");
        break;

      case SMTC_MODEM_EVENT_LINK_CHECK:
        APP_LOG(TS_OFF, VLEVEL_M,  "Event received: LINK_CHECK\r\n");
        break;

      case SMTC_MODEM_EVENT_CLASS_B_PING_SLOT_INFO:
        APP_LOG(TS_OFF, VLEVEL_M,  "Event received: CLASS_B_PING_SLOT_INFO\r\n");
        break;

      case SMTC_MODEM_EVENT_CLASS_B_STATUS:
        APP_LOG(TS_OFF, VLEVEL_M,  "Event received: CLASS_B_STATUS\r\n");
        break;

      case SMTC_MODEM_EVENT_LORAWAN_MAC_TIME:
        APP_LOG(TS_OFF, VLEVEL_L,  "Event received: LORAWAN MAC TIME\r\n");
        break;

      case SMTC_MODEM_EVENT_LORAWAN_FUOTA_DONE:
      {
        bool status = current_event.event_data.fuota_status.successful;
        if (status == true)
        {
          APP_LOG(TS_OFF, VLEVEL_M,  "Event received: FUOTA SUCCESSFUL\r\n");
        }
        else
        {
          APP_LOG(TS_OFF, VLEVEL_L,  "Event received: FUOTA FAIL\r\n");
        }
        break;
      }

      case SMTC_MODEM_EVENT_NO_MORE_MULTICAST_SESSION_CLASS_C:
        APP_LOG(TS_OFF, VLEVEL_M,  "Event received: MULTICAST CLASS_C STOP\r\n");
        break;

      case SMTC_MODEM_EVENT_NO_MORE_MULTICAST_SESSION_CLASS_B:
        APP_LOG(TS_OFF, VLEVEL_M,  "Event received: MULTICAST CLASS_B STOP\r\n");
        break;

      case SMTC_MODEM_EVENT_NEW_MULTICAST_SESSION_CLASS_C:
        APP_LOG(TS_OFF, VLEVEL_M,  "Event received: New MULTICAST CLASS_C \r\n");
        break;

      case SMTC_MODEM_EVENT_NEW_MULTICAST_SESSION_CLASS_B:
        APP_LOG(TS_OFF, VLEVEL_M,  "Event received: New MULTICAST CLASS_B\r\n");
        break;

      case SMTC_MODEM_EVENT_FIRMWARE_MANAGEMENT:
        APP_LOG(TS_OFF, VLEVEL_M,  "Event received: FIRMWARE_MANAGEMENT\r\n");
        if (current_event.event_data.fmp.status == SMTC_MODEM_EVENT_FMP_REBOOT_IMMEDIATELY)
        {
          HAL_NVIC_SystemReset();
        }
        break;

      case SMTC_MODEM_EVENT_STREAM_DONE:
        APP_LOG(TS_OFF, VLEVEL_M,  "Event received: STREAM_DONE\r\n");
        break;

      case SMTC_MODEM_EVENT_UPLOAD_DONE:
        APP_LOG(TS_OFF, VLEVEL_M,  "Event received: UPLOAD_DONE\r\n");
        break;

      case SMTC_MODEM_EVENT_DM_SET_CONF:
        APP_LOG(TS_OFF, VLEVEL_M,  "Event received: DM_SET_CONF\r\n");
        break;

      case SMTC_MODEM_EVENT_MUTE:
        APP_LOG(TS_OFF, VLEVEL_M,  "Event received: MUTE\r\n");
        break;
      case SMTC_MODEM_EVENT_REGIONAL_DUTY_CYCLE:
      {
        uint8_t duty_cycle_status = current_event.event_data.regional_duty_cycle.status;
        APP_LOG(TS_OFF, VLEVEL_M,  "Event received: DUTY_CYCLE busy %d\r\n", duty_cycle_status);
      }
      break;
      default:
        APP_LOG(TS_OFF, VLEVEL_M,  "Unknown event %u\r\n", current_event.event_type);
        break;
    }
  } while (event_pending_count > 0);
}

/* USER CODE BEGIN PB_Callbacks */

void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
{
  switch (GPIO_Pin)
  {
    case  BUT1_Pin:
      /* Note: when "EventType == TX_ON_TIMER" this GPIO is not initialized */
      if (EventType == TX_ON_EVENT)
      {
        static uint32_t last_press_timestamp_ms = 0;

        /* Debounce the button press, avoid multiple triggers */
        if ((int32_t)(SysTimeToMs(SysTimeGet()) - last_press_timestamp_ms) > 500)
        {
          last_press_timestamp_ms = SysTimeToMs(SysTimeGet());
          user_button_is_press    = true;
        }
      }
      break;
    default:
      break;
  }
}


/* USER CODE END PB_Callbacks */

static void append_u16_be(uint8_t *buffer, uint8_t *index, uint16_t value)
{
  buffer[*index] = (uint8_t)((value >> 8) & 0xFFU);
  (*index)++;
  buffer[*index] = (uint8_t)(value & 0xFFU);
  (*index)++;
}

static void append_i16_be(uint8_t *buffer, uint8_t *index, int16_t value)
{
  append_u16_be(buffer, index, (uint16_t)value);
}

static void SendTxData(uint8_t port)
{
  /* USER CODE BEGIN SendTxData_1 */
  sensor_t sensor_data;
  uint8_t bufferSize = 0;
  uint8_t uplink_port = TX_PORT_ENV_BASE;

  (void)port;

  /* Increment tx_counter */
  tx_counter++;
  if (tx_counter > 6U)
  {
    tx_counter = 1U;
  }

  /* Determine which sensors to read this cycle */
  uint8_t sensor_flags = 0U;
  if (tx_counter % 3U == 0U) { sensor_flags |= SENSOR_FLAG_CO2; }
  if (tx_counter % 6U == 0U) { sensor_flags |= SENSOR_FLAG_SPS30; }

  /* Read sensors */
  EnvSensors_Read(&sensor_data, sensor_flags);

  /* Log raw stored values (scaling noted in unit label). Receiver / human
   * reader converts: T/100 = degC, RH/100 = %, P/10 = hPa. */
  APP_LOG(TS_ON, VLEVEL_M, "Sensors: T=%d [0.01degC], RH=%u [0.01%%], P=%u [0.1hPa], VBAT=%u mV\r\n",
          (int)sensor_data.temperature,
          (unsigned)sensor_data.humidity,
          (unsigned)sensor_data.pressure,
          (unsigned)sensor_data.battery_voltage);

  APP_LOG(TS_ON, VLEVEL_M, "LTR390: UV=%lu [raw]\r\n", (unsigned long)sensor_data.uv_raw);

  if (sensor_flags & SENSOR_FLAG_CO2)
  {
    APP_LOG(TS_ON, VLEVEL_M, "SCD41: CO2=%u ppm\r\n", (unsigned int)sensor_data.co2_ppm);
  }

  if (sensor_flags & SENSOR_FLAG_SPS30)
  {
    APP_LOG(TS_ON, VLEVEL_M, "SPS30 MC: PM1.0=%u PM2.5=%u PM4.0=%u PM10.0=%u [0.1 ug/m3]\r\n",
            (unsigned)sensor_data.pm1_0,
            (unsigned)sensor_data.pm2_5,
            (unsigned)sensor_data.pm4_0,
            (unsigned)sensor_data.pm10_0);
    APP_LOG(TS_ON, VLEVEL_M, "SPS30 NC: PM0.5=%u PM1.0=%u PM2.5=%u PM4.0=%u PM10=%u [0.1 #/cm3]\r\n",
            (unsigned)sensor_data.nc_0_5,
            (unsigned)sensor_data.nc_1_0,
            (unsigned)sensor_data.nc_2_5,
            (unsigned)sensor_data.nc_4_0,
            (unsigned)sensor_data.nc_10_0);
    APP_LOG(TS_ON, VLEVEL_M, "SPS30 TypSize=%u [nm]\r\n", (unsigned)sensor_data.typ_size);
  }

