TexhFexLabs/HydroNodeStation/stm32_node/LoRaWAN/App/lora_app.c
      (void)SPS30_ReleaseBus();

      break;
    }
    case RX_CMD_SOFTWARE_RESET:
      APP_LOG(TS_ON, VLEVEL_M, "Message: Trigger software reset\r\n");
      HAL_NVIC_SystemReset();
      break;
    default:
      APP_LOG(TS_ON, VLEVEL_M, "Message: Unknown command 0x%02X\r\n", (unsigned)command);
      break;
  }
}


/* USER CODE BEGIN PrFD_LedEvents */
/*static bool IsAllZero(const uint8_t *buffer, uint8_t size)
{
  for (uint8_t i = 0; i < size; i++)
  {
    if (buffer[i] != 0U)
    {
      return false;
    }
  }

  return true;
}*/

//static void OnTxTimerLedEvent(void *context)
//{
  // HAL_GPIO_WritePin(LED2_GPIO_Port, LED2_Pin, GPIO_PIN_RESET); /* LED_GREEN */
//}

//static void OnRxTimerLedEvent(void *context)
//{
  //HAL_GPIO_WritePin(LED1_GPIO_Port, LED1_Pin, GPIO_PIN_RESET); /* LED_BLUE */
//}

//static void OnJoinTimerLedEvent(void *context)
//{
  // HAL_GPIO_TogglePin(LED3_GPIO_Port, LED3_Pin); /* LED_RED */
//}

static void OnScd41TimerEvent(void *context)
{
  APP_LOG(TS_ON, VLEVEL_M, "SCD41 pre-measurement started\r\n");
  EnvSensors_StartPreMeasurement(SENSOR_FLAG_CO2);
}

static void OnSps30TimerEvent(void *context)
{
  APP_LOG(TS_ON, VLEVEL_M, "SPS30 pre-measurement started\r\n");
  EnvSensors_StartPreMeasurement(SENSOR_FLAG_SPS30);
}

static void OnSps30CleanupTimerEvent(void *context)
{
  APP_LOG(TS_ON, VLEVEL_M, "SPS30 cleaning finished, going to sleep\r\n");
  (void)SPS30_StopMeasurement();
  (void)SPS30_Sleep();
}

/* USER CODE END PrFD_LedEvents */

#if defined (LOW_POWER_DISABLE) && (LOW_POWER_DISABLE == 0)
static void OnSleepTimerEvent(void *context)
{
  /* USER CODE BEGIN OnSleepTimerEvent_1 */

  /* USER CODE END OnSleepTimerEvent_1 */
  APP_LOG(TS_ON, VLEVEL_H, "Sleep timer\r\n");

  /* USER CODE BEGIN OnSleepTimerEvent_Last */

  /* USER CODE END OnSleepTimerEvent_Last */
}
#endif /*(LOW_POWER_DISABLE) && (LOW_POWER_DISABLE == 0) */

/* --- EOF ------------------------------------------------------------------ */
